asciidoctor.asciidoctor-vscode
bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
charliermarsh.ruff
chrislajoie.vscode-modelines
dotenv.dotenv-vscode
dotjoshjohnson.xml
eamodio.gitlens
editorconfig.editorconfig
github.codespaces
katjanakosic.vscode-json5
mads-hartmann.bash-ide-vscode
mechatroner.rainbow-csv
mkhl.shfmt
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vsliveshare.vsliveshare
openai.chatgpt
rangav.vscode-thunder-client
redhat.vscode-yaml
tamasfe.even-better-toml
tetradresearch.vscode-h2o
vscodevim.vim
wayou.vscode-todo-highlight
zaucy.symlink-follow