tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# [macos]: macOS has own versions
# [gnu]: GNU dialect

# Interactive
brew "bash" # [macos]
brew "bash-completion@2"
brew "zsh" # [macos]
brew "tmux"
brew "zoxide"
brew "tree"
brew "pstree"
brew "neovim"
brew "less" # [macos]
brew "mandoc" # [macos]
brew "mac-db" # [macos]
brew "tldr"
brew "kube-ps1", args: ["ignore-dependencies"]
brew "gum"
brew "ncurses" # [macos,keg-only]
brew "ptpython"

# Searching
brew "ack"
brew "fzf"
brew "grep" # [macos]

# Viewing
brew "bat"

# Data inspection/processing/formatting
brew "awk" # [macos] nawk
brew "gawk" # [macos] g-prefixed
brew "gnu-sed" # [macos] g-prefixed
brew "jq"
brew "jless"
brew "yq",
brew "gomplate"
brew "pandoc"
brew "groff"

# Network clients
brew "bind" # [macos]
brew "nmap"
brew "curl" # [macos,keg-only]
brew "wget"
brew "websocat"
brew "grpcurl"

# Security tools
brew "gnupg"
brew "krb5" # [macos,keg-only]

# Devtools
brew "cmake"
brew "make" # [macos]
brew "gh"
brew "git" # [macos]
brew "git-delete-merged-branches"
brew "git-delta"
brew "git-lfs"
brew "hub"
brew "jesseduffield/lazygit/lazygit"
brew "helm"
brew "tilt"
brew "subversion"

# Language tools
brew "ruby"
brew "shellcheck"
brew "shfmt"

# Etc
brew "gnu-tar" # [macos] g-prefixed
brew "expect" # [macos]
brew "coreutils" # [macos] g-prefixed
brew "diffutils" # [macos] g-prefixed
brew "findutils" # [macos] g-prefixed
brew "pipx"
cask "nikitabobko/tap/aerospace"