tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "ack"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bind"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "exa"
brew "expect"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delete-merged-branches"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gomplate"
brew "grep"
brew "groff"
brew "grpcurl"
brew "gum"
brew "helm"
brew "jq"
brew "jless"
brew "krb5"
brew "kube-ps1", args: ["ignore-dependencies"]
brew "less"
brew "make"
brew "mandoc"
brew "ncurses"
brew "neovim"
brew "nmap"
brew "pandoc"
brew "pipx"
brew "pstree"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "subversion"
brew "tldr"
brew "tmux"
brew "tree"
brew "websocat"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh"
